#### Outcome: 🟨  add=1 change=0 destroy=1
#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```\n
[32m[1mSuccess![0m The configuration is valid.[0m
```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!-/+ destroy and then create replacement

OpenTofu will perform the following actions:

# # github_actions_environment_secret.encrypted_secrets["development-talos#TF_VAR_master_node"] must be replaced
!-/+ resource "github_actions_environment_secret" "encrypted_secrets" {
!     ~ created_at      = "2025-11-25 21:52:20 +0000 UTC" -> (known after apply)
!     ~ id              = "k6haze:development-talos:TF_VAR_master_node" -> (known after apply)
-     ~ plaintext_value = (sensitive value) # forces replacement
!     ~ updated_at      = "2025-11-25 21:52:20 +0000 UTC" -> (known after apply)
#       # (3 unchanged attributes hidden)
+   }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @ryan-kraay-sigstore, Action: `pull_request`, Working Directory: ``, Workflow: `Full CI/CD Pipeline`*`;
<!-- Sticky Pull Request Commentcurator-github -->